---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalUtils
source: html/f7cbd23a-1b69-d9bf-88b4-df10a8c4be0b.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalUtils

General utility methods in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public static class MechanicalUtils
```